---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingLength
source: html/f3dec5d9-4733-2972-af1e-0a220fc93345.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingLength Property

"Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingLength { get; }
```